In [4]:
import pandas as pd
test1 = pd.DataFrame({ 'Nama':['A','B','C','D','E' ],
'Test1':[67,45,68,78,96],
'Test2':[70,86,79,97,68],
'Test3':[80,86,78,85,48]})

In [6]:
test1.head()

  Nama  Test1  Test2  Test3
0    A     67     70     80
1    B     45     86     86
2    C     68     79     78
3    D     78     97     85
4    E     96     68     48

In [62]:
def kriteria(x):
    if x < 70:
        return x,'remedial'
    else:
        return x,'lulus'

In [63]:
nilai= test1.iloc[:,1:4]

In [85]:
test1['Test1'].apply(kriteria)

0    (67, remedial)
1    (45, remedial)
2    (68, remedial)
3       (78, lulus)
4       (96, lulus)
Name: Test1, dtype: object

In [87]:
test1['Nama'].apply(len)

0    1
1    1
2    1
3    1
4    1
Name: Nama, dtype: int64

In [89]:
len(test1['Nama'])

5

In [96]:
test1['Test1'].apply(lambda x:x*x)

0    4489
1    2025
2    4624
3    6084
4    9216
Name: Test1, dtype: int64

In [101]:
test1['Nama'].apply(lambda x:x[0])

0    A
1    B
2    C
3    D
4    E
Name: Nama, dtype: object

In [102]:
test1['Nama'].apply(lambda x:len(x))

0    1
1    1
2    1
3    1
4    1
Name: Nama, dtype: int64

In [103]:
test1

  Nama  Test1  Test2  Test3
0    A     67     70     80
1    B     45     86     86
2    C     68     79     78
3    D     78     97     85
4    E     96     68     48

In [105]:
test1['Nilai Akhir'] = (test1['Test1'] + test1['Test2'] + test1['Test3']) / 3

In [106]:
test1

  Nama  Test1  Test2  Test3  Hasil Akhir
0    A     67     70     80    72.333333
1    B     45     86     86    72.333333
2    C     68     79     78    75.000000
3    D     78     97     85    86.666667
4    E     96     68     48    70.666667

In [115]:
data = {'Daerah': ['Jakarta','Jakarta','BSD','BSD','BSD','Jakarta'],
'Cuaca': ['Hujan','Hujan','Cerah','Cerah','Hujan','Hujan'],
'Temperatur':['Dingin','Dingin','Panas','Dingin','Dingin','Dingin'],
'Penjualan Payung':[12,15,9,0,15,17]}
data1=pd.DataFrame(data)

In [116]:
data1

    Daerah  Cuaca Temperatur  Penjualan Payung
0  Jakarta  Hujan     Dingin                12
1  Jakarta  Hujan     Dingin                15
2      BSD  Cerah      Panas                 9
3      BSD  Cerah     Dingin                 0
4      BSD  Hujan     Dingin                15
5  Jakarta  Hujan     Dingin                17

In [117]:
data1.pivot_table(values='Penjualan Payung',index=['Daerah','Cuaca'],columns=['Temperatur'])

Temperatur        Dingin  Panas
Daerah  Cuaca
BSD     Cerah   0.000000    9.0
        Hujan  15.000000    NaN
Jakarta Hujan  14.666667    NaN